sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=1/bench.log
/localhome/local-triv/sglang-env/lib/python3.12/site-packages/torch/cuda/__init__.py:61: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=3, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, request_rate=inf, max_concurrency=1, output_file='/localhome/local-triv/sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=1/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=3, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, request_rate=inf, max_concurrency=1, output_file='/localhome/local-triv/sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=1/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)

#Input tokens: 1183
#Output tokens: 1744
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 3/3 [00:20<00:00,  6.70s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 1         
Successful requests:                     3         
Benchmark duration (s):                  20.10     
Total input tokens:                      1183      
Total generated tokens:                  1744      
Total generated tokens (retokenized):    1744      
Request throughput (req/s):              0.15      
Input token throughput (tok/s):          58.85     
Output token throughput (tok/s):         86.75     
Total token throughput (tok/s):          145.60    
Concurrency:                             1.00      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   6696.20   
Median E2E Latency (ms):                 8716.18   
---------------Time to First Token----------------
Mean TTFT (ms):                          60.40     
Median TTFT (ms):                        43.21     
P99 TTFT (ms):                           100.72    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.43     
Median ITL (ms):                         11.43     
P95 ITL (ms):                            11.69     
P99 ITL (ms):                            11.75     
Max ITL (ms):                            15.66     
==================================================